; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l8-t1-p5---int100n150-m25---int100c110---s112---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level17 level17)
(sum level0 level23 level23)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level17 level18)
(sum level1 level23 level24)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level17 level19)
(sum level2 level23 level25)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level17 level20)
(sum level3 level23 level26)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level17 level21)
(sum level4 level23 level27)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level17 level22)
(sum level5 level23 level28)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level17 level23)
(sum level6 level23 level29)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level17 level24)
(sum level7 level23 level30)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level17 level25)
(sum level8 level23 level31)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level17 level26)
(sum level9 level23 level32)
(sum level9 level25 level34)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level17 level27)
(sum level10 level23 level33)
(sum level10 level25 level35)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level17 level28)
(sum level11 level23 level34)
(sum level11 level25 level36)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level17 level29)
(sum level12 level23 level35)
(sum level12 level25 level37)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level17 level30)
(sum level13 level23 level36)
(sum level13 level25 level38)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level17 level31)
(sum level14 level23 level37)
(sum level14 level25 level39)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level17 level32)
(sum level15 level23 level38)
(sum level15 level25 level40)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level17 level33)
(sum level16 level23 level39)
(sum level16 level25 level41)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level17 level34)
(sum level17 level23 level40)
(sum level17 level25 level42)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level17 level35)
(sum level18 level23 level41)
(sum level18 level25 level43)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level17 level36)
(sum level19 level23 level42)
(sum level19 level25 level44)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level17 level37)
(sum level20 level23 level43)
(sum level20 level25 level45)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level17 level38)
(sum level21 level23 level44)
(sum level21 level25 level46)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level17 level39)
(sum level22 level23 level45)
(sum level22 level25 level47)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level17 level40)
(sum level23 level23 level46)
(sum level23 level25 level48)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level17 level41)
(sum level24 level23 level47)
(sum level24 level25 level49)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level17 level42)
(sum level25 level23 level48)
(sum level25 level25 level50)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level17 level43)
(sum level26 level23 level49)
(sum level26 level25 level51)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level17 level44)
(sum level27 level23 level50)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level17 level45)
(sum level28 level23 level51)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level17 level46)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level17 level47)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level17 level48)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level17 level49)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level17 level50)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level17 level51)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level10 level51)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level48 level3 level51)

(connected l0 l7)
(fuelcost level11 l0 l7)
(connected l1 l5)
(fuelcost level8 l1 l5)
(connected l1 l6)
(fuelcost level4 l1 l6)
(connected l1 l7)
(fuelcost level10 l1 l7)
(connected l2 l5)
(fuelcost level5 l2 l5)
(connected l2 l7)
(fuelcost level4 l2 l7)
(connected l3 l5)
(fuelcost level3 l3 l5)
(connected l3 l6)
(fuelcost level17 l3 l6)
(connected l3 l7)
(fuelcost level11 l3 l7)
(connected l4 l7)
(fuelcost level25 l4 l7)
(connected l5 l1)
(fuelcost level8 l5 l1)
(connected l5 l2)
(fuelcost level5 l5 l2)
(connected l5 l3)
(fuelcost level3 l5 l3)
(connected l5 l6)
(fuelcost level23 l5 l6)
(connected l6 l1)
(fuelcost level4 l6 l1)
(connected l6 l3)
(fuelcost level17 l6 l3)
(connected l6 l5)
(fuelcost level23 l6 l5)
(connected l6 l7)
(fuelcost level6 l6 l7)
(connected l7 l0)
(fuelcost level11 l7 l0)
(connected l7 l1)
(fuelcost level10 l7 l1)
(connected l7 l2)
(fuelcost level4 l7 l2)
(connected l7 l3)
(fuelcost level11 l7 l3)
(connected l7 l4)
(fuelcost level25 l7 l4)
(connected l7 l6)
(fuelcost level6 l7 l6)

(at t0 l2)
(fuel t0 level51)
(= (total-cost) 0)

(at p0 l7)
(at p1 l6)
(at p2 l6)
(at p3 l6)
(at p4 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l0)
(at p3 l7)
(at p4 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l2 l7 level47 level4 level51)
   deleted: (at t0 l2) (fuel t0 level51)
   added: (at t0 l7) (fuel t0 level47)
   goals met: 0 of 5
2. (load p0 t0 l7)
   deleted: (at p0 l7)
   added: (in p0 t0)
   goals met: 0 of 5
3. (drive t0 l7 l6 level41 level6 level47)
   deleted: (at t0 l7) (fuel t0 level47)
   added: (at t0 l6) (fuel t0 level41)
   goals met: 0 of 5
4. (load p3 t0 l6)
   deleted: (at p3 l6)
   added: (in p3 t0)
   goals met: 0 of 5
5. (load p2 t0 l6)
   deleted: (at p2 l6)
   added: (in p2 t0)
   goals met: 0 of 5
6. (load p1 t0 l6)
   deleted: (at p1 l6)
   added: (in p1 t0)
   goals met: 0 of 5
7. (drive t0 l6 l1 level37 level4 level41)
   deleted: (at t0 l6) (fuel t0 level41)
   added: (at t0 l1) (fuel t0 level37)
   goals met: 0 of 5
8. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 5
9. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 5
10. (drive t0 l1 l5 level29 level8 level37)
   deleted: (at t0 l1) (fuel t0 level37)
   added: (at t0 l5) (fuel t0 level29)
   goals met: 1 of 5
11. (drive t0 l5 l3 level26 level3 level29)
   deleted: (at t0 l5) (fuel t0 level29)
   added: (at t0 l3) (fuel t0 level26)
   goals met: 1 of 5
12. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 2 of 5
13. (drive t0 l3 l7 level15 level11 level26)
   deleted: (at t0 l3) (fuel t0 level26)
   added: (at t0 l7) (fuel t0 level15)
   goals met: 2 of 5
14. (unload p3 t0 l7)
   deleted: (in p3 t0)
   added: (at p3 l7)
   goals met: 3 of 5
15. (drive t0 l7 l0 level4 level11 level15)
   deleted: (at t0 l7) (fuel t0 level15)
   added: (at t0 l0) (fuel t0 level4)
   goals met: 3 of 5
16. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 4 of 5
17. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 5 of 5
